'''
Задание 5
Напишите программу, вычисляющую площадь прямоугольника. Пользователь с клавиатуры вводит ширину
и высоту прямоугольника.
'''

width = float(input("Введите ширину прямоугольника: "))
height = float(input("Введите высоту прямотреугольника: "))

area = (width * height) / 2

print(area)
