'''
Задание 3
Пользователь вводит с клавиатуры два числа. Необходимо найти сумму чисел, разницу чисел, произведение
числе. Результат вычислений вывести на экран.
'''

number1 = float(input("Введите число №1: "))
number2 = float(input("Введите число №2: "))

print("Сумма чисел:", number1 + number2,"\nPазницa чисел:", number1 - number2,"\nПроизведение чисел:", number1 * number2)
