'''
Задание 4
Напишите программу, вычисляющую площадь 
треугольника. Пользователь с клавиатуры вводит размер основания треугольника и размер 
высоты.
'''

footing = float(input("Введите размер основания: "))
height = float(input("Введите размер высоты: "))
print((footing * height)/2)
