'''
Задание 2
Пользователь вводит с клавиатуры номер месяца (1-12). Необходимо вывести на экран название
месяца. Например, если 1, то на экране надпись
январь, 2 — февраль и т.д.
'''

number = input("Введите номер месяца: ")

if number == '1':
    print("январь")
if number == '2':
    print("февраль")
if number == '3':
    print("март")
if number == '4':
    print("апрель")
if number == '5':
    print("май")
if number == '6':
    print("июнь")
if number == '7':
    print("июль")
if number == '8':
    print("август")
if number == '9':
    print("сентябрь")
if number == '10':
    print("октяюрь")
if number == '11':
    print("ноябрь")
if number == '12':
    print("декабрь")
