'''
Задание 3
Напишите программу, вычисляющую площадь
ромба. Пользователь с клавиатуры вводит длину
двух его диагоналей.
'''

a = float(input("Введите диагональ1: "))
b = float(input("Введите диагональ2: "))
print("Площадь ромба: ", (a * b)/2 )
