'''
Задание 1
Пользователь вводит с клавиатуры три числа.
Необходимо найти сумму чисел, произведение
чисел. Результат вычислений вывести на экран.
'''

a = float(input("Введите число№1: "))
b = float(input("Введите число№2: "))
c = float(input("Введите число№3: "))
print("Сумма чисел: ", a + b + c, ";Произведение чисел: ", a * b *c)


